# Найти все уникальные символы в строке

text = input("Enter some text: ")

unique_symbols = set(text)


print(f"Unique symbols: {unique_symbols}")
